# A cat clone with syntax highlighting and Git integration
brew "bat"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# The basic file, shell and text manipulation utilities of the GNU operating system
brew "coreutils"
# A command line tool for transferring files with URL syntax
brew "curl"
# Tool to read, write and edit EXIF meta information
brew "exiftool"
# Lightweight video thumbnailer
brew "ffmpegthumbnailer"
# GNU Find Utilities, the basic directory searching utilities of the GNU operating system
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU implementation of the Awk programming language
brew "gawk"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# GNU sed, a batch stream editor
brew "gsed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GNU implementation of the `tar' archiver
brew "gnu-tar"
# GNU implementation of the Unix grep command
brew "grep"
# Software suite to create, edit, compose, or convert bitmap images
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Conversion library
brew "libiconv"
# Postgres C API library
brew "libpq"
# XML parsing library for C
brew "libxml2"
# YAML 1.1 parser and emitter written in C
brew "libyaml"
# Simple terminal UI for git commands
brew "lazygit"
# Language Server for the Lua language
brew "lua-language-server"
# Utility for directing compilation
brew "make" # GNU make
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# A cryptographic library that implements the SSL and TLS protocols
brew "openssl@3"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Line-oriented search tool that recursively searches the current directory for a regex pattern
brew "ripgrep"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Minimal, blazing fast, and extremely customizable prompt for any shell
brew "starship"
# Opinionated Lua code formatter
brew "stylua"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Executes a program periodically, showing output fullscreen
brew "watch"

# Casks
cask "1password"
cask "docker"
cask "google-chrome"
cask "font-fira-code-nerd-font"
cask "flux"
cask "karabiner-elements"
cask "kitty"
